#include<bits/stdc++.h>
using namespace std;
int main(){
	freopen("equation.in","r",stdin);
	freopen("equation.out","w",stdout);
	ios::sync_with_stdio(0);
	cin.tie(0);
	cout.tie(0);
//666,kan bu dong yi dian,xie dou bu hui xie,wo zhen fu le,na me nan de ti mu zuo bu liao yi dian.
//	废废废废废废废废废                废                废废废废废废废                                       
//	        废                     废    废                        废                                    
//		  废废  废              废  废废废  废                   废                 
//	    废  废    废         废                废              废                       
//	  废    废      废            废废废废废                    废                                               
//	废      废                       废                          废                                                             
//	        废                      废  废                        废                                  
//		    废                     废废废废                    废废                                                       
	cout<<"666，bro会不了一点，这个式子都看不懂，我写都写不出来\n";
	cout<<"测评姬给点分吧，给多给少都行啊";
}

/*

稻香
周杰伦

对这个世界如果你有太多的抱怨
跌倒了就不敢继续往前走
为什么人要这么的脆弱堕落
请你打开电视看看多少人
为生命在努力勇敢的走下去
我们是不是该知足
珍惜一切就算没有拥有

还记得你说家是唯一的城堡
随着稻香河流继续奔跑
微微笑 小时候的梦我知道
不要哭让萤火虫带着你逃跑
乡间的歌谣永远的依靠
回家吧 回到最初的美好

不要这么容易就像放弃就像我说的
追不到的梦想换个梦不就得了
为自己的人生鲜妍上色
先把爱涂上喜欢的颜色
笑一个吧 功成名就不是目的
让自己快乐快乐才叫意义
童年的纸飞机现在终于飞回我手里

所谓的那快乐赤脚在田里追蜻蜓追到累了
偷摘水果被蜜蜂给叮到怕了
谁在偷笑呢
我靠着稻草人 吹着风 唱着歌 睡着了
哦哦 午后吉他在风中更清脆
哦哦 阳光洒在路上就不怕心碎
珍惜一切就算没有拥有

还记得你说家是唯一的城堡
随着稻香河流继续奔跑
微微笑 小时候的梦我知道
不要哭让萤火虫带着你逃跑
乡间的歌谣永远的依靠
回家吧 回到最初的美好

还记得你说家是唯一的城堡
随着稻香河流继续奔跑
微微笑 小时候的梦我知道
不要哭让萤火虫带着你逃跑
乡间的歌谣永远的依靠
回家吧 回到最初的美好

*/

/*

晴天
周杰伦

故事的小黄花
从出生那年就飘着
童年的荡秋千
随记忆一直晃到现在

吹着前奏望着天空
我想起花瓣试着飘落
为你翘课的那一天
花落的那一天
教室的那一间
我怎么看不见
消失的下雨天我好想再淋一遍
哦没想到失去的勇气我还留着
哦好想在问一遍
你会等待还是离开

刮风这天我试过握着你手
但偏偏雨渐渐大到我看你不见
还要多久我才能在你身边
等到放晴的那天也许我会比较好一点

从前从前有个人爱你很久
但偏偏风渐渐把距离吹的好远
好不容易又能在多爱一天
但故事的最后你还是说了 拜拜

为你翘课的那一天
花落的那一天
教室的那一间
我怎么看不见
消失的下雨天我好想再淋一遍
哦没想到失去的勇气我还留着
（好想在问一遍）
你会等待还是离开

刮风这天我试过握着你手
但偏偏雨渐渐大到我看你不见
还要多久我才能在你身边
等到放晴的那天也许我会比较好一点

从前从前有个人爱你很久
但偏偏雨渐渐把距离吹的好远
好不容易又能在多爱一天
但故事的最后你还是说了 拜拜

（从前从前有个人爱你很久
但偏偏雨渐渐大到我看你不见
还要多久我才能在你身边
但故事的最后你还是说了拜）

*/

/*

发如雪
周杰伦

狼牙月 伊人憔悴
我举杯 饮尽了风雪
是谁打翻前世柜 惹尘埃是非
缘字缺 几翻轮回
你锁眉 哭红颜换不回
纵然情史已经成灰 我爱不灭

繁花如三千东流水
我只取一瓢爱了解
只恋你化身的蝶

你发如雪凄美了离别
我焚香感动了谁
邀明月让回忆皎洁
爱在月光下完美

你发如雪纷飞了眼泪
我等待苍老了谁
红尘醉微醺的岁月
我用无悔 刻永世爱你的碑

你发如雪凄美了离别
我焚香感动了谁
邀明月让回忆皎洁
爱在月光下完美

你发如雪纷飞了眼泪
我等待苍老了谁
红尘醉微醺的岁月

你发如雪凄美了离别
我焚香感动了谁
邀明月让回忆皎洁
爱在月光下完美

你发如雪纷飞了眼泪
我等待苍老了谁
红尘醉微醺的岁月
我用无悔 刻永世爱你的碑

啦儿啦啦儿啦啦儿啦儿啦
啦儿啦啦儿啦啦儿啦儿啦
铜镜映无邪扎马尾
你若撒野今生我把酒奉陪

啦儿啦啦儿啦啦儿啦儿啦
啦儿啦啦儿啦啦儿啦儿啦
铜镜映无邪扎马尾
你若撒野今生我把酒奉陪

*/
